Tekla Open API Reference for Tekla Structures 2025
AnalysisLoadGroup.IsEmpty Method
 Check if load group is empty (no loading exists).
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsEmpty()
Public Function IsEmpty As Boolean
Return Value
Type: Boolean
True if load group is empty (no loading exists).
See Also
Reference
AnalysisLoadGroup Class
Tekla.Structures.Analysis Namespace